Revit 2027 API
IndependentTag.MergeElbows Property
 Identifies if the leaders' elbows are merged or not. If they are are merged, all elbows are in the same point and they move together.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool MergeElbows { get; set; }
Public Property MergeElbows As Boolean
	Get
	Set
public:
property bool MergeElbows {
	bool get ();
	void set (bool value);
}
member MergeElbows : bool with get, set
Property Value
Boolean
Exceptions
Exception | Condition
InvalidOperationException |  The IndependentTag object does not have a tag behavior. -or- When setting this property: For this tag leaders are not allowed. -or- When setting this property: Can't merge elbows for tags that are part of a multi-reference annotation.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace